Tutorials/gasMixture/mixingChannel-1/0.orig/H2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.06;

boundaryField
{
    walls
    {
        type            slip;
    }
    inlet1
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet2
    {
        type            fixedValue;
        value           uniform 1;
    }
    outlet
    {
//	type            advective;
//	rho             rho;
//	phi             rhoPhi;
//	value           $internalField;
//	lInf		0.0;
//	fieldInf	0.06;
	type		zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
